In [1]:
# How to convert two lists in one list

In [2]:
r = [[1,2],[3,4]]

In [3]:
r

[[1, 2], [3, 4]]

In [4]:
[j for i in r for j in i]

[1, 2, 3, 4]

In [5]:
# how to combine 2 list l1=[1,2,3] l2=['a','b','c']?

In [6]:
l1 = [1,2,3]
l2 = ['a','b','c']

In [7]:
l1 = l1+l2

In [8]:
l1

[1, 2, 3, 'a', 'b', 'c']

In [9]:
# hoe to convert multiple str in one str

In [10]:
f = ['hi','How are you','I am fine','What about you','Relax mode guys']

In [11]:
l = ' '.join([str(ele) for ele in f])

In [12]:
l

'hi How are you I am fine What about you Relax mode guys'

In [13]:
# u have list=['a','b','c'] join it like ['a,b,c']. Do it

In [14]:
l=['a','b','c']

In [15]:
list=['a','b','c']

In [16]:
a = ','.join([str(ele) for ele in list])

In [17]:
a

'a,b,c'

In [18]:
list1 = ['g', 'e', 'e', 'k', 's']
print("".join(list1))

geeks

In [19]:
# suppose their is a string=('a','e','i','o','u') how to make it different like ('a','e','i'), ('o','u')?

In [20]:
s = ('a','e','i','o','u')

In [21]:
l1 = []
l2 = []
for i in s:
    if i in ['a','e','i']:
        l1.append(i)
    else:
        l2.append(i)
print(l1)
print(l2)

['a', 'e', 'i']
['o', 'u']

In [22]:
new_l3= set(l1)

In [23]:
new_l3

{'a', 'e', 'i'}

In [24]:
new_l2 = set(l2)

In [25]:
new_l2

{'o', 'u'}

In [26]:
# Adv python:=
#=============
# Money Paching:=
#==============   Monkey patching in python refers to modifying or updating a piece of code or class or 
#                 any module at the runtime. In simple words, we can change the behavior or working of a class/ module 
#                 at the runtime without changing the whole python code. But sometimes monkey patching is considered bad 
#                 practice because the definition of object does not accurately describe how the object is behaving in the code.

In [27]:
# define a for loop to add elements in list.

In [28]:
s= 'raju','akki','rahul','jadhav','koli'

In [29]:
ls = []
for i in s:
    if i in ['raju','akki','rahul','jadhav','koli']:
        ls.append(i)
print(ls)

['raju', 'akki', 'rahul', 'jadhav', 'koli']

In [30]:
# str='abcd' print only 'abc'? how to do it? 
# use typecasting or
# use replace

In [37]:
str = 'abcd'

In [38]:
str.replace('abcd','abc')

'abc'

In [39]:
# write a list comprehension for even numbers

In [40]:
ls = [i for i in range(10) if (i%2==0)]

In [41]:
ls

[0, 2, 4, 6, 8]

In [42]:
# write a dictionary comprehension for even numbers upto 100.

In [43]:
evens=[number for number in range(1,101) if number%2==0]
even_dict={k:evens[k-1] for k in range(1,len(evens)+1)}

In [44]:
even_dict

{1: 2,
 2: 4,
 3: 6,
 4: 8,
 5: 10,
 6: 12,
 7: 14,
 8: 16,
 9: 18,
 10: 20,
 11: 22,
 12: 24,
 13: 26,
 14: 28,
 15: 30,
 16: 32,
 17: 34,
 18: 36,
 19: 38,
 20: 40,
 21: 42,
 22: 44,
 23: 46,
 24: 48,
 25: 50,
 26: 52,
 27: 54,
 28: 56,
 29: 58,
 30: 60,
 31: 62,
 32: 64,
 33: 66,
 34: 68,
 35: 70,
 36: 72,
 37: 74,
 38: 76,
 39: 78,
 40: 80,
 41: 82,
 42: 84,
 43: 86,
 44: 88,
 45: 90,
 46: 92,
 47: 94,
 48: 96,
 49: 98,
 50: 100}

In [47]:
a = (1,2,5,'raju')

In [48]:
a.add(20)

AttributeError: 'tuple' object has no attribute 'add'

In [49]:
# ow to merge 2 dictionaries?

In [50]:
def Merge(a,b):
    fun = {**a,**b}
    return fun

a = {'id':5048, 'name':'rajiv'}
b = {'city':'Pune','pan':'DOKLLP'}
c = Merge(a,b)

print(c)

{'id': 5048, 'name': 'rajiv', 'city': 'Pune', 'pan': 'DOKLLP'}

In [51]:
#in a function assigned a value x=10 then how it get stored in python? ***

In [52]:
def add(y):
    global x
    x=10
    print(x+y)

In [53]:
add(10)

20

In [54]:
x

10

In [55]:
a = x

In [56]:
a

10

In [57]:
# SQL question
# 2 tables --- 1 is emp, 2 dept --- 
# emp --- id name dept_id salary 
# dept --- id name 
# find highest salary of all department

In [58]:
import pandas as pd

In [59]:
emp = {
    'id':[10,20,30,40,50,60,70,80],
    'name':['raju','akki','suraj','rahul','monu','pooja','rohini','kartik'],
    'dept_id':[5048,3163,4512,5263,4587,1659,4253,1665],
    'salary':[95000,80000,75000,90000,45000,68000,78000,95000]
}

In [60]:
dept = {
    'id':[10,20,30,40,50,60,70,80],
    'dept_name':['HR','ENGG','CIVIL','MECH','ENGG','CIVIL','HR','MECH']
}

In [61]:
emp_df = pd.DataFrame(emp)

In [62]:
dept_df= pd.DataFrame(dept)

In [63]:
emp_df

   id    name  dept_id  salary
0  10    raju     5048   95000
1  20    akki     3163   80000
2  30   suraj     4512   75000
3  40   rahul     5263   90000
4  50    monu     4587   45000
5  60   pooja     1659   68000
6  70  rohini     4253   78000
7  80  kartik     1665   95000

In [64]:
dept_df

   id dept_name
0  10        HR
1  20      ENGG
2  30     CIVIL
3  40      MECH
4  50      ENGG
5  60     CIVIL
6  70        HR
7  80      MECH

In [65]:
final_df = pd.merge(emp_df,dept_df,on='id',how='outer')

In [66]:
final_df

   id    name  dept_id  salary dept_name
0  10    raju     5048   95000        HR
1  20    akki     3163   80000      ENGG
2  30   suraj     4512   75000     CIVIL
3  40   rahul     5263   90000      MECH
4  50    monu     4587   45000      ENGG
5  60   pooja     1659   68000     CIVIL
6  70  rohini     4253   78000        HR
7  80  kartik     1665   95000      MECH

In [67]:
final_df[['salary','dept_name']]

   salary dept_name
0   95000        HR
1   80000      ENGG
2   75000     CIVIL
3   90000      MECH
4   45000      ENGG
5   68000     CIVIL
6   78000        HR
7   95000      MECH

In [68]:
df_HR_salary = final_df.loc[0,'salary'] + final_df.loc[6,'salary']

In [69]:
df_HR_salary

173000

In [70]:
df_ENGG_salary = final_df.loc[1,'salary'] + final_df.loc[4,'salary']

In [71]:
df_ENGG_salary

125000

In [72]:
df_CIVIL_salary = final_df.loc[2,'salary'] + final_df.loc[5,'salary']

In [73]:
df_CIVIL_salary

143000

In [74]:
df_MECH_salary = final_df.loc[3,'salary'] + final_df.loc[7,'salary']

In [75]:
df_MECH_salary

185000

In [1]:
# How to merge two dictionaries

In [5]:
def Merge(a,b):
    raj={**a,**b}
    return raj
    
a = {'Name':'Rajiv Patil','City':'Pune'}
b = {'Id':5048, 'Mob':7020380691}
c = Merge(a,b)

print(c)

{'Name': 'Rajiv Patil', 'City': 'Pune', 'Id': 5048, 'Mob': 7020380691}

In [6]:
def Merge(a,b):
    data = {**a,**b}
    return data

a = {'Id':5048,'Actor':'Akshay'}
b = {'city':'Pune','Location':'Bengaluru'}
c = Merge(a,b)

print(c)

{'Id': 5048, 'Actor': 'Akshay', 'city': 'Pune', 'Location': 'Bengaluru'}

In [7]:
actors = ['akki','salman','srk','aamir','ajay']
favourite = []
for a in actors:
    if a in ['akki','srk','aamir']:
        favourite.append(a)
print(favourite)

['akki', 'srk', 'aamir']

In [8]:
favourite = [a for a in actors if  a in ['akki','srk','aamir']]

In [9]:
favourite

['akki', 'srk', 'aamir']

In [1]:
# print the numbers from 1 to 50, but of multiples of three print 'fizz' instead of number & 
# for multiples of five print 'buzz', for the numbers which are multiple of both three & five print 'fizzbuzz

In [7]:
for Fizzbuzz in range(1,51):
    if Fizzbuzz % 3 == 0 & Fizzbuzz % 5 == 0:
        print("Fizzbuzz")
        continue
    elif Fizzbuzz % 3 == 0:
        print("Fizz")
        continue
    elif Fizzbuzz % 5 == 0:
        print("buzz")
        continue
    print("Fizzbuzz")

Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
buzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
buzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
buzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
buzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
buzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
buzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
Fizzbuzz
buzz

In [1]:
# Find prime numbers using lambda functions

In [3]:
prime = list(filter(lambda x:all(x % y !=0 for y in range(2,x)),range(100)))
print(prime)

[0, 1, 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97]

In [4]:
# Find prime numbers using list functions

In [18]:
prime_list = [x for x in range(100) if all(x % y != 0 for y in range(2, x))]

In [21]:
prime_list

[0,
 1,
 2,
 3,
 5,
 7,
 11,
 13,
 17,
 19,
 23,
 29,
 31,
 37,
 41,
 43,
 47,
 53,
 59,
 61,
 67,
 71,
 73,
 79,
 83,
 89,
 97]

In [22]:
prime = [x for x in range(10) if all(x%y!=0 for y in range(2,x))]

In [23]:
prime

[0, 1, 2, 3, 5, 7]